### Homework

Solve this in a new Jupyter notebook, and then upload it to GitHub. Name the notebook as 'hw_data_structures'.

In [31]:
import pandas

names=["Thomas", "Pauline", "Pablo", "Bjork", "Alan", "Juana"]
woman=[False, True, False, False, False, True]
age=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway", "Peru", "Peru"]
education=["Bach", "Bach", "Master", "PhD", "Bach", "Master"]

#Turning above into dict and giving it the name 'data'
data={'names':names, 'woman':woman, 'age':age, 'country':country, 'education':education}
data

#Now creating a data frame
friends=pandas.DataFrame.from_dict(data)

#Now we want to see how it looks
friends

     names  woman  age  country education
0   Thomas  False   32    Chile      Bach
1  Pauline   True   33  Senegal      Bach
2    Pablo  False   28    Spain    Master
3    Bjork  False   30   Norway       PhD
4     Alan  False   32     Peru      Bach
5    Juana   True   27     Peru    Master

If you have the query:

In [ ]:
# where is the youngest male in the group from?

In [33]:
toSort=["woman", "age"]
Order=[True, True]
friends.sort_values(by=toSort,ascending=Order)

     names  woman  age  country education
2    Pablo  False   28    Spain    Master
3    Bjork  False   30   Norway       PhD
0   Thomas  False   32    Chile      Bach
4     Alan  False   32     Peru      Bach
5    Juana   True   27     Peru    Master
1  Pauline   True   33  Senegal      Bach

In [34]:
friends[friends.woman==False].sort_values('age',ascending=True).head(1).country

2    Spain
Name: country, dtype: object

a. Find the answer using *sort_values()*

b. Do some research and find the answer using *[where()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.where.html)* and *[min()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.min.html)*

c. Do some research and find the answer using *[query()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.query.html)* and *[min()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.min.html)*

In [59]:
# Why do we have this order...

friends.where(friends.age==friends[~friends.woman].age.min()).dropna()

   names  woman   age country education
2  Pablo    0.0  28.0   Spain    Master

In [60]:
friends.query('~woman').query('age==age.min()')

   names  woman  age country education
2  Pablo  False   28   Spain    Master

Solve this in a new Jupyter notebook, and then upload it to GitHub. Name the notebook as 'hw_data_structures'.